## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-058b954d1d93f922e&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-06f0c654c36b650c0&quot;]` |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0ed36f14e4004fb68&quot;]` |
| update | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone   = "UTC"
            # (7 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-058b954d1d93f922e"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-058b954d1d93f922e"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-06f0c654c36b650c0"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-06f0c654c36b650c0"
      + vpc_id                 = (known after apply)
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0ed36f14e4004fb68"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3"
      + id                     = (known after apply)
      + subnet_id              = "subnet-0ed36f14e4004fb68"
      + vpc_id                 = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
